Revit 2024 API
CustomInitialColor Class
 This class encapsulates a custom initial lighting color.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class CustomInitialColor : InitialColor
Visual Basic
Public Class CustomInitialColor _
	Inherits InitialColor
Visual C++
public ref class CustomInitialColor : public InitialColor
Remarks
 This color is called an initial color because a color filter can also be added to modify the color.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialColor
 Autodesk.Revit.DB.Lighting.CustomInitialColor
See Also
CustomInitialColor Members
Autodesk.Revit.DB.Lighting Namespace